app/controllers/experts_controller.rb

  def index
    @experts = Expert.all
---
SELECT "experts".* FROM "experts"

  def edit
    friend = Friendship.new
    friend.expert_id = params[:id]
    friend.friend_id = params[:new_friend]
    friend.save
    expert = Expert.find(params[:id])
---
INSERT INTO "friendships" ("expert_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["expert_id", 5], ["friend_id", 4], ["created_at", "2018-02-11 23:28:18.622869"], ["updated_at", "2018-02-11 23:28:18.622869"]]
SELECT  "experts".* FROM "experts" WHERE "experts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def show
    @expert = Expert.find(params[:id])
    if params[:expert] != nil && params[:expert]['term'] != ""
      @term = params[:expert]['term']
      @search_results = search_topic @expert, @term
    end

    @topics = Topic.where(expert_id: params[:id]).order(tag: :asc)
    #@frineds = Friendship.joins(Expert).where(Expert.id = Friendship.expert_id).and(Friendship.expert_id = params[:id])
    @frineds = Expert.distinct.joins("INNER JOIN friendships ON experts.id = friendships.friend_id")
                         .where("friendships.expert_id = " + params[:id])
    #Company.joins(:price_movements,:goods_movements).where("goods_movement.date = price_movement.date")
    @other_experts = Expert.joins("LEFT JOIN friendships ON experts.id = friendships.expert_id")
---
SELECT  "experts".* FROM "experts" WHERE "experts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "topics".* FROM "topics" WHERE "topics"."expert_id" = ? ORDER BY "topics"."tag" DESC  [["expert_id", 1]]
SELECT "experts".* FROM "experts" INNER JOIN friendships ON experts.id = friendships.expert_id WHERE ("experts"."friend_id" != ?)  [["friend_id", "5"]]
SELECT experts.name as name FROM "friendships" INNER JOIN experts ON experts.id = friendships.friend_id WHERE "friendships"."expert_id" = ?  [["expert_id", 5]]
SELECT "experts".* FROM "experts" LEFT JOIN friendships ON experts.id = friendships.expert_id

  def create
    new_params = expert_params
    if new_params[:website] != ''
      uri = URI('https://www.googleapis.com/urlshortener/v1/url?key=AIzaSyAbhcPpkrdWTzK3fJSSHZRuguUUMSyJYeA')
      https = Net::HTTP.new(uri.host, uri.port)
      https.use_ssl = true
      req = Net::HTTP::Post.new(uri.request_uri, 'Content-Type' => 'application/json')
      req.body = {longUrl: new_params[:website]}.to_json
      short_response = https.request(req)

      if short_response.code == '200'
        short_json = JSON.parse(short_response.body)
        new_params[:short_website] = short_json["id"]
      end
    end

    @expert = Expert.new(new_params)
    get_topics @expert, new_params[:website]

    if @expert.save
---
INSERT INTO "experts" ("name", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "George"], ["website", "https://en.wikipedia.org/wiki/George_Washington"], ["created_at", "2018-02-10 19:47:54.954371"], ["updated_at", "2018-02-10 19:47:54.954371"]]